fio_test/wuliji_randrw_ext4
wuliji_randrw_ext4: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=256
...
fio-3.28
Starting 8 processes
wuliji_randrw_ext4: Laying out IO file (1 file / 8192MiB)

wuliji_randrw_ext4: (groupid=0, jobs=8): err= 0: pid=15587: Sat Aug 16 01:08:14 2025
  read: IOPS=13.2k, BW=51.5MiB/s (54.0MB/s)(3094MiB/60108msec)
    slat (nsec): min=880, max=136903k, avg=19295.05, stdev=486235.42
    clat (usec): min=132, max=351654, avg=108712.01, stdev=65486.61
     lat (usec): min=1546, max=361132, avg=108731.41, stdev=65503.36
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   22], 10.00th=[   36], 20.00th=[   53],
     | 30.00th=[   65], 40.00th=[   75], 50.00th=[   91], 60.00th=[  114],
     | 70.00th=[  140], 80.00th=[  169], 90.00th=[  205], 95.00th=[  232],
     | 99.00th=[  279], 99.50th=[  292], 99.90th=[  326], 99.95th=[  338],
     | 99.99th=[  347]
   bw (  KiB/s): min=20311, max=118291, per=100.00%, avg=52727.05, stdev=2653.31, samples=959
   iops        : min= 5076, max=29571, avg=13180.87, stdev=663.32, samples=959
  write: IOPS=5649, BW=22.1MiB/s (23.1MB/s)(1327MiB/60108msec); 0 zone resets
    slat (nsec): min=990, max=130387k, avg=21673.93, stdev=621474.32
    clat (usec): min=1851, max=351487, avg=108732.10, stdev=65402.39
     lat (usec): min=1889, max=357693, avg=108753.88, stdev=65417.48
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   22], 10.00th=[   36], 20.00th=[   53],
     | 30.00th=[   65], 40.00th=[   75], 50.00th=[   91], 60.00th=[  115],
     | 70.00th=[  140], 80.00th=[  169], 90.00th=[  205], 95.00th=[  232],
     | 99.00th=[  279], 99.50th=[  292], 99.90th=[  326], 99.95th=[  338],
     | 99.99th=[  347]
   bw (  KiB/s): min= 9013, max=50262, per=100.00%, avg=22608.23, stdev=1137.03, samples=959
   iops        : min= 2251, max=12564, avg=5651.16, stdev=284.27, samples=959
  lat (usec)   : 250=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.15%, 20=4.00%, 50=12.26%
  lat (msec)   : 100=37.70%, 250=43.01%, 500=2.86%
  cpu          : usr=0.50%, sys=2.16%, ctx=473518, majf=0, minf=132
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=792070,339596,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=51.5MiB/s (54.0MB/s), 51.5MiB/s-51.5MiB/s (54.0MB/s-54.0MB/s), io=3094MiB (3244MB), run=60108-60108msec
  WRITE: bw=22.1MiB/s (23.1MB/s), 22.1MiB/s-22.1MiB/s (23.1MB/s-23.1MB/s), io=1327MiB (1391MB), run=60108-60108msec

Disk stats (read/write):
  nvme0n1: ios=791551/339411, merge=85/117, ticks=85566708/36690143, in_queue=122257369, util=99.99%